In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv("Employee.csv")
df1

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
df1.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [5]:
df1.tail()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB

In [7]:
df1['City'].sample(5)

4452    Bangalore
4401         Pune
3865    Bangalore
2815    Bangalore
1344    New Delhi
Name: City, dtype: object

In [8]:
df2 = pd.read_csv("test.txt")
df2

Empty DataFrame
Columns: [it's a test file]
Index: []

In [9]:
type(df2)

pandas.core.frame.DataFrame

In [10]:
df2.head()

Empty DataFrame
Columns: [it's a test file]
Index: []

In [11]:
df2.tail()

Empty DataFrame
Columns: [it's a test file]
Index: []

In [12]:
df2.describe()

       it's a test file
count                 0
unique                0
top                 NaN
freq                NaN

In [13]:
df3 = pd.read_json("json.json")
df3

                                                              user
id                                                             101
name                                                       Alireza
email                                          alireza@example.com
location                                              Tehran, Iran
preferences      {'language': 'Persian', 'theme': 'dark', 'noti...
recent_activity  [{'type': 'login', 'timestamp': '2025-10-15T08...

In [14]:
df3.head()

                                                          user
id                                                         101
name                                                   Alireza
email                                      alireza@example.com
location                                          Tehran, Iran
preferences  {'language': 'Persian', 'theme': 'dark', 'noti...

In [15]:
df3.tail()

                                                              user
name                                                       Alireza
email                                          alireza@example.com
location                                              Tehran, Iran
preferences      {'language': 'Persian', 'theme': 'dark', 'noti...
recent_activity  [{'type': 'login', 'timestamp': '2025-10-15T08...

In [16]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, id to recent_activity
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   user    6 non-null      object
dtypes: object(1)
memory usage: 96.0+ bytes

In [17]:
df3.describe()

        user
count      6
unique     6
top      101
freq       1